{
    "info": {
        "buildVersion": "1600",
        "cmdVersion": "1.6.0.0",
        "securityUpdate": "yes"
    },
    "whatsNew": {
        "1": "Actualizari de securitate.",
        "2": "Cod imbunatatit, bug fixes."
        
    },
    "updateLogs": {
        "1": "--- v1.5 ---",
        "2": "A fost adaugat un sistem pentru acordarea licentelor de tip boat in mod semi-automat.",
        "3": "Momentan, nu a fost posibila verificarea ajungerii la un mal, deci va trebui voi sa apasati manual butonul [Test licenta] dupa ce modul va detecta ca s-a deplasat din locul de pornire. Dupa aceasta, modul va continua sa faca totul in mod automat pana la acordarea licentei. ATENTIE! Sistemul este inca in stagiul beta, deci pot aparea anumite probleme / buguri.",
        "4": "A fost adaugat un sistem pentru acordarea licentei fly in mod automat. Momentan, acesta este inca in stagiul beta, de aceea pot aparea anumite probleme. Daca intampinati buguri, nu ezitati sa ma contactati.",
        "5": "Pentru a folosi metoda de acodare a licentelor fly in mod automat, dupa ce selectati tipul licentei, apasati pe butonul de toggle [Test fly automat] si dupa aceasta pe [Test licenta], de aici modul va face totul automat.",
        "6": "Adaugat /startlesson automat atunci cand se detecteaza ca clientul are level 90+.",
        "7": "Rezolvat un bug de la licenta gun automata.",
        "8": "Pentru verificatori: A fost adaugata optiune de a duce evidenta testelor cerute. Acestea se inregistreaza automat cand folositi comanda /vt si se sterg numai atunci cand le stergeti voi. Accesati meniul -> Instructor -> Teste cerute pentru a vedea lista, sau folositi comanda /teste. De asemenea, veti primi cate un reminder in chat dupa ce expira cate o ora. Optiunea va fi disponibila numai daca aveti activat /vt-ul din setari.",
        "9": "Micsorat range-ul la revenire la licentele fly si boat automate.",
        "10": "Rezolvate unele buguri critice.",
        "11": "Adaugata verificare daca clientul are level 90+ atunci cand apasati butonul [Test licenta]. Daca acesta are peste level 90, modul va cere automat numai banii. Asigurati-va ca aveti metoda automata de acordare a licentelor activata.",
        "12": "Rezolvate anumite buguri in cazul acordarii automate a licentei fly.",
        "13": "Adaugata optiune pentru screenshot automat la solicitari in cazul licentelor fly si boat (cu mod automat activat).",
        "14": "De acum, se vor salva preferintele pentru testele gun/fly/boat automate.",
        "15": " ",
        "16": "--- v1.4 ---",
        "17": "De acum, puteti activa din setari optiunea de a porni motorul masinii + farurile acesteia automat cand urcati intr-o masina. Optiunea este dezactivata by default.",
        "18": "A fost adaugata optiunea de a afisa informatiile din /stats intr-un dialog. Optiunea poate fi activata/dezactivata din setari, iar default este dezactivata.",
        "19": "A fost adaugata optiunea de a da automat /engine si /fill atunci cand opresti masina la o benzinarie. Optiunea poate fi activata/dezactivata din setari.",
        "20": "A fost adaugata comanda [/buyguns]. Cu ajutorul acesteia puteti cumpara un anumit numar de arme din gun shop.",
        "21": "A fost prescurtata comanda /reply in /rp.",
        "22": "Actualizari de securitate.",
        "23": "Utilizarea comenzii /gk fara vreun ID, va da key automat celui mai apropiat jucator, iar /gk [id] - jucatorului cu ID-ul introdus.",
        "24": "Au fost mutati pasii cu numarul 2 de la licentele fly si boat. Dupa ce incepeti licenta, peste 5 secunde se vor da mesajele cu decolare / deplasare la un mal.",
        "25": "Rezolvat un bug la auto screenshot, care nu numara mereu randurile corect.",
        "26": "Adaugata verificare pentru plata la licentele fly si boat. De acum, modul va astepta sa plateasca banii, o sa verifice daca au trecut 60 de secunde, iar dupa asta ii va da licenta.",
        "27": "Rezolvat un bug ce nu vedea corect suma de $1,000,000 la plata licentei.",
        "28": "Adaugata optiune de auto screenshot la fiecare X randuri. Deschideti setarile pentru a configura.",
        "29": "Pentru rank 6/7 in factiuni: Cand jucatorul accepta /invite, o sa se trimita automat un mesaj de bun venit.",
        "30": "Reparat un bug ce oprea modul la /vt.",
        "31": "Adaugata o lista cu toate actualizarile modului de pana acum.",
        "32": "Cod optimizat."
    },
    "arr": {
        "Twenty": "",
        "Lust": "",
        "Faith": "",
        "JoaquinGuzman": "King.",
        "Goody": "",
        "Cluny": "_Crips",
        "Alex": "",
        ".Danutzu.": "King.",
        "Feier": "_Crips"
    }
}